#### Terraform CI/CD Results

- **Format Check**: `success`
- **Initialization**: `success`
- **Validation**: `success`
- **Plan**: `success`

<details><summary>📋 Show Terraform Plan</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_artifact_registry_repository.web_test_docker_repo will be created
  + resource "google_artifact_registry_repository" "web_test_docker_repo" {
      + create_time      = (known after apply)
      + description      = "Docker repository for the web-test project"
      + effective_labels = {
          + "environment" = "test"
          + "managed_by"  = "terraform"
          + "project"     = "web-test"
        }
      + format           = "DOCKER"
      + id               = (known after apply)
      + labels           = {
          + "environment" = "test"
          + "managed_by"  = "terraform"
          + "project"     = "web-test"
        }
      + location         = "asia-southeast1"
      + mode             = "STANDARD_REPOSITORY"
      + name             = (known after apply)
      + project          = "github-chatgpt-ggcloud"
      + repository_id    = "web-test"
      + terraform_labels = {
          + "environment" = "test"
          + "managed_by"  = "terraform"
          + "project"     = "web-test"
        }
      + update_time      = (known after apply)
    }

  # google_cloud_run_v2_service.directus will be created
  + resource "google_cloud_run_v2_service" "directus" {
      + conditions              = (known after apply)
      + create_time             = (known after apply)
      + creator                 = (known after apply)
      + delete_time             = (known after apply)
      + effective_annotations   = (known after apply)
      + effective_labels        = (known after apply)
      + etag                    = (known after apply)
      + expire_time             = (known after apply)
      + generation              = (known after apply)
      + id                      = (known after apply)
      + ingress                 = (known after apply)
      + last_modifier           = (known after apply)
      + latest_created_revision = (known after apply)
      + latest_ready_revision   = (known after apply)
      + launch_stage            = (known after apply)
      + location                = "asia-southeast1"
      + name                    = "directus-test"
      + observed_generation     = (known after apply)
      + project                 = "github-chatgpt-ggcloud"
      + reconciling             = (known after apply)
      + terminal_condition      = (known after apply)
      + terraform_labels        = (known after apply)
      + traffic_statuses        = (known after apply)
      + uid                     = (known after apply)
      + update_time             = (known after apply)
      + uri                     = (known after apply)

      + template {
          + max_instance_request_concurrency = (known after apply)
          + service_account                  = "chatgpt-deployer@github-chatgpt-ggcloud.iam.gserviceaccount.com"
          + timeout                          = (known after apply)

          + containers {
              + image = "directus/directus:11.2.2"

              + env {
                  + name  = "DB_CLIENT"
                  + value = "mysql"
                }
              + env {
                  + name  = "DB_HOST"
                  + value = "localhost"
                }
              + env {
                  + name  = "DB_PORT"
                  + value = "3306"
                }
              + env {
                  + name  = "DB_SOCKET_PATH"
                  + value = (known after apply)
                }
              + env {
                  + name  = "DB_DATABASE"
                  + value = "directus"
                }
              + env {
                  + name  = "DB_USER"
                  + value = "directus"
                }
              + env {
                  + name  = "ADMIN_EMAIL"
                  + value = "admin@example.com"
                }
              + env {
                  + name  = "PUBLIC_URL"
                  + value = "https://directus-test-812872501910.asia-southeast1.run.app"
                }
              + env {
                  + name  = "WEBSOCKETS_ENABLED"
                  + value = "true"
                }
              + env {
                  + name = "DB_PASSWORD"

                  + value_source {
                      + secret_key_ref {
                          + secret  = "DIRECTUS_DB_PASSWORD_test"
                          + version = "latest"
                        }
                    }
                }
              + env {
                  + name = "KEY"

                  + value_source {
                      + secret_key_ref {
                          + secret  = "DIRECTUS_KEY_test"
                          + version = "latest"
                        }
                    }
                }
              + env {
                  + name = "SECRET"

                  + value_source {
                      + secret_key_ref {
                          + secret  = "DIRECTUS_SECRET_test"
                          + version = "latest"
                        }
                    }
                }

              + liveness_probe {
                  + failure_threshold     = 3
                  + initial_delay_seconds = 10
                  + period_seconds        = 10
                  + timeout_seconds       = 3

                  + http_get {
                      + path = "/server/health"
                      + port = 8055
                    }
                }

              + ports (known after apply)

              + resources {
                  + limits = {
                      + "cpu"    = "1000m"
                      + "memory" = "512Mi"
                    }
                }

              + startup_probe {
                  + failure_threshold     = 10
                  + initial_delay_seconds = 10
                  + period_seconds        = 10
                  + timeout_seconds       = 3

                  + http_get {
                      + path = "/server/health"
                      + port = 8055
                    }
                }

              + volume_mounts {
                  + mount_path = "/cloudsql"
                  + name       = "cloudsql"
                }
            }

          + scaling {
              + max_instance_count = 5
              + min_instance_count = 0
            }

          + volumes {
              + name = "cloudsql"

              + cloud_sql_instance {
                  + instances = (known after apply)
                }
            }
        }

      + traffic {
          + percent = 100
          + type    = "TRAFFIC_TARGET_ALLOCATION_TYPE_LATEST"
        }
    }

  # google_cloud_run_v2_service_iam_member.directus_public_access will be created
  + resource "google_cloud_run_v2_service_iam_member" "directus_public_access" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + location = "asia-southeast1"
      + member   = "allUsers"
      + name     = "directus-test"
      + project  = "github-chatgpt-ggcloud"
      + role     = "roles/run.invoker"
    }

  # google_project_service.artifactregistry will be created
  + resource "google_project_service" "artifactregistry" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "github-chatgpt-ggcloud"
      + service            = "artifactregistry.googleapis.com"
    }

  # google_project_service.run will be created
  + resource "google_project_service" "run" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "github-chatgpt-ggcloud"
      + service            = "run.googleapis.com"
    }

  # google_project_service.secretmanager will be created
  + resource "google_project_service" "secretmanager" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "github-chatgpt-ggcloud"
      + service            = "secretmanager.googleapis.com"
    }

  # google_project_service.sqladmin will be created
  + resource "google_project_service" "sqladmin" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "github-chatgpt-ggcloud"
      + service            = "sqladmin.googleapis.com"
    }

  # google_secret_manager_secret.directus_db_password will be created
  + resource "google_secret_manager_secret" "directus_db_password" {
      + create_time           = (known after apply)
      + effective_annotations = (known after apply)
      + effective_labels      = {
          + "environment" = "test"
          + "managed_by"  = "terraform"
          + "project"     = "web-test"
        }
      + expire_time           = (known after apply)
      + id                    = (known after apply)
      + labels                = {
          + "environment" = "test"
          + "managed_by"  = "terraform"
          + "project"     = "web-test"
        }
      + name                  = (known after apply)
      + project               = "github-chatgpt-ggcloud"
      + secret_id             = "DIRECTUS_DB_PASSWORD_test"
      + terraform_labels      = {
          + "environment" = "test"
          + "managed_by"  = "terraform"
          + "project"     = "web-test"
        }

      + replication {
          + user_managed {
              + replicas {
                  + location = "asia-southeast1"
                }
            }
        }
    }

  # google_secret_manager_secret.directus_key will be created
  + resource "google_secret_manager_secret" "directus_key" {
      + create_time           = (known after apply)
      + effective_annotations = (known after apply)
      + effective_labels      = {
          + "environment" = "test"
          + "managed_by"  = "terraform"
          + "project"     = "web-test"
        }
      + expire_time           = (known after apply)
      + id                    = (known after apply)
      + labels                = {
          + "environment" = "test"
          + "managed_by"  = "terraform"
          + "project"     = "web-test"
        }
      + name                  = (known after apply)
      + project               = "github-chatgpt-ggcloud"
      + secret_id             = "DIRECTUS_KEY_test"
      + terraform_labels      = {
          + "environment" = "test"
          + "managed_by"  = "terraform"
          + "project"     = "web-test"
        }

      + replication {
          + user_managed {
              + replicas {
                  + location = "asia-southeast1"
                }
            }
        }
    }

  # google_secret_manager_secret.directus_secret will be created
  + resource "google_secret_manager_secret" "directus_secret" {
      + create_time           = (known after apply)
      + effective_annotations = (known after apply)
      + effective_labels      = {
          + "environment" = "test"
          + "managed_by"  = "terraform"
          + "project"     = "web-test"
        }
      + expire_time           = (known after apply)
      + id                    = (known after apply)
      + labels                = {
          + "environment" = "test"
          + "managed_by"  = "terraform"
          + "project"     = "web-test"
        }
      + name                  = (known after apply)
      + project               = "github-chatgpt-ggcloud"
      + secret_id             = "DIRECTUS_SECRET_test"
      + terraform_labels      = {
          + "environment" = "test"
          + "managed_by"  = "terraform"
          + "project"     = "web-test"
        }

      + replication {
          + user_managed {
              + replicas {
                  + location = "asia-southeast1"
                }
            }
        }
    }

  # google_secret_manager_secret_iam_member.directus_db_password_accessor will be created
  + resource "google_secret_manager_secret_iam_member" "directus_db_password_accessor" {
      + etag      = (known after apply)
      + id        = (known after apply)
      + member    = "serviceAccount:chatgpt-deployer@github-chatgpt-ggcloud.iam.gserviceaccount.com"
      + project   = "github-chatgpt-ggcloud"
      + role      = "roles/secretmanager.secretAccessor"
      + secret_id = "DIRECTUS_DB_PASSWORD_test"
    }

  # google_secret_manager_secret_iam_member.directus_key_accessor will be created
  + resource "google_secret_manager_secret_iam_member" "directus_key_accessor" {
      + etag      = (known after apply)
      + id        = (known after apply)
      + member    = "serviceAccount:chatgpt-deployer@github-chatgpt-ggcloud.iam.gserviceaccount.com"
      + project   = "github-chatgpt-ggcloud"
      + role      = "roles/secretmanager.secretAccessor"
      + secret_id = "DIRECTUS_KEY_test"
    }

  # google_secret_manager_secret_iam_member.directus_secret_accessor will be created
  + resource "google_secret_manager_secret_iam_member" "directus_secret_accessor" {
      + etag      = (known after apply)
      + id        = (known after apply)
      + member    = "serviceAccount:chatgpt-deployer@github-chatgpt-ggcloud.iam.gserviceaccount.com"
      + project   = "github-chatgpt-ggcloud"
      + role      = "roles/secretmanager.secretAccessor"
      + secret_id = "DIRECTUS_SECRET_test"
    }

  # google_secret_manager_secret_version.directus_db_password will be created
  + resource "google_secret_manager_secret_version" "directus_db_password" {
      + create_time           = (known after apply)
      + deletion_policy       = "DELETE"
      + destroy_time          = (known after apply)
      + enabled               = true
      + id                    = (known after apply)
      + is_secret_data_base64 = false
      + name                  = (known after apply)
      + secret                = (known after apply)
      + secret_data           = (sensitive value)
      + version               = (known after apply)
    }

  # google_secret_manager_secret_version.directus_key will be created
  + resource "google_secret_manager_secret_version" "directus_key" {
      + create_time           = (known after apply)
      + deletion_policy       = "DELETE"
      + destroy_time          = (known after apply)
      + enabled               = true
      + id                    = (known after apply)
      + is_secret_data_base64 = false
      + name                  = (known after apply)
      + secret                = (known after apply)
      + secret_data           = (sensitive value)
      + version               = (known after apply)
    }

  # google_secret_manager_secret_version.directus_secret will be created
  + resource "google_secret_manager_secret_version" "directus_secret" {
      + create_time           = (known after apply)
      + deletion_policy       = "DELETE"
      + destroy_time          = (known after apply)
      + enabled               = true
      + id                    = (known after apply)
      + is_secret_data_base64 = false
      + name                  = (known after apply)
      + secret                = (known after apply)
      + secret_data           = (sensitive value)
      + version               = (known after apply)
    }

  # random_password.directus_db_password will be created
  + resource "random_password" "directus_db_password" {
      + bcrypt_hash = (sensitive value)
      + id          = (known after apply)
      + length      = 32
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (sensitive value)
      + special     = true
      + upper       = true
    }

  # random_password.directus_key will be created
  + resource "random_password" "directus_key" {
      + bcrypt_hash = (sensitive value)
      + id          = (known after apply)
      + length      = 64
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (sensitive value)
      + special     = false
      + upper       = true
    }

  # random_password.directus_secret will be created
  + resource "random_password" "directus_secret" {
      + bcrypt_hash = (sensitive value)
      + id          = (known after apply)
      + length      = 64
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (sensitive value)
      + special     = false
      + upper       = true
    }

  # module.mysql_directus.google_sql_database.database will be created
  + resource "google_sql_database" "database" {
      + charset         = (known after apply)
      + collation       = (known after apply)
      + deletion_policy = "DELETE"
      + id              = (known after apply)
      + instance        = "mysql-directus-web-test"
      + name            = "directus"
      + project         = "github-chatgpt-ggcloud"
      + self_link       = (known after apply)
    }

  # module.mysql_directus.google_sql_database_instance.instance will be created
  + resource "google_sql_database_instance" "instance" {
      + available_maintenance_versions = (known after apply)
      + connection_name                = (known after apply)
      + database_version               = "MYSQL_8_0"
      + deletion_protection            = true
      + dns_name                       = (known after apply)
      + encryption_key_name            = (known after apply)
      + first_ip_address               = (known after apply)
      + id                             = (known after apply)
      + instance_type                  = (known after apply)
      + ip_address                     = (known after apply)
      + maintenance_version            = (known after apply)
      + master_instance_name           = (known after apply)
      + name                           = "mysql-directus-web-test"
      + private_ip_address             = (known after apply)
      + project                        = "github-chatgpt-ggcloud"
      + psc_service_attachment_link    = (known after apply)
      + public_ip_address              = (known after apply)
      + region                         = "asia-southeast1"
      + self_link                      = (known after apply)
      + server_ca_cert                 = (sensitive value)
      + service_account_email_address  = (known after apply)

      + replica_configuration (known after apply)

      + settings {
          + activation_policy     = "ALWAYS"
          + availability_type     = "ZONAL"
          + connector_enforcement = (known after apply)
          + disk_autoresize       = true
          + disk_autoresize_limit = 50
          + disk_size             = 10
          + disk_type             = "PD_SSD"
          + edition               = "ENTERPRISE"
          + pricing_plan          = "PER_USE"
          + tier                  = "db-g1-small"
          + user_labels           = (known after apply)
          + version               = (known after apply)

          + backup_configuration {
              + binary_log_enabled             = true
              + enabled                        = true
              + start_time                     = "01:00"
              + transaction_log_retention_days = 7

              + backup_retention_settings {
                  + retained_backups = 7
                  + retention_unit   = "COUNT"
                }
            }

          + database_flags {
              + name  = "max_connections"
              + value = "100"
            }

          + insights_config (known after apply)

          + ip_configuration {
              + ipv4_enabled   = true
              + server_ca_mode = (known after apply)
              + ssl_mode       = (known after apply)
            }

          + location_preference (known after apply)

          + maintenance_window {
              + day          = 7
              + hour         = 3
              + update_track = "stable"
            }
        }
    }

  # module.mysql_directus.google_sql_user.user[0] will be created
  + resource "google_sql_user" "user" {
      + host                    = (known after apply)
      + id                      = (known after apply)
      + instance                = "mysql-directus-web-test"
      + name                    = "directus"
      + password                = (sensitive value)
      + project                 = "github-chatgpt-ggcloud"
      + sql_server_user_details = (known after apply)
    }

Plan: 22 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + artifact_registry_repository = {
      + format   = "DOCKER"
      + id       = "web-test"
      + location = "asia-southeast1"
      + name     = (known after apply)
    }
  + directus_service             = {
      + name = "directus-test"
      + url  = (known after apply)
    }
  + environment                  = "test"
  + mysql_instance               = {
      + activation      = "ALWAYS"
      + connection_name = (known after apply)
      + database_name   = "directus"
      + disk_size       = 10
      + disk_type       = "PD_SSD"
      + name            = "mysql-directus-web-test"
      + region          = "asia-southeast1"
      + tier            = "db-g1-small"
    }
  + project_id                   = "github-chatgpt-ggcloud"
  + region                       = "asia-southeast1"
  + secrets                      = {
      + directus_db_password = "DIRECTUS_DB_PASSWORD_test"
      + directus_key         = "DIRECTUS_KEY_test"
      + directus_secret      = "DIRECTUS_SECRET_test"
    }

```

</details>

---
**Directory**: `terraform`
**Pushed by**: @Huyen1974
**Commit**: 858b641d60bb5eb63f2b7953942ede29c04a3524
